from random import randint
# print(2021 % 29)


# print(2021 - (72 * 28))
# n = 2021
# while n > 0:
#     n = n - 29

#     k = randint(1, 28)
#     if k > n:
#         print('человек забрал', n, ' конфет')
#         n = 0
#         print('осталось -', n, ' конфет')
#         print('выйграл человек')
#     else:
#         n = n - k
#         print('человек забрал ', k, ' конфет')
#         print('осталось -', n, ' конфет')
#         m = 29 - k
#         if m > n:
#             print('бот забрал', n, ' конфет')
#             n = 0
#             print('осталось -', n, ' конфет')
#             print('выйграл бот')
#         else:
#             n = n - m
#             print('бот забрал ', m, ' конфет')
#             print('осталось -', n, ' конфет')

n = 2021
n = int(n) - 20
while n >= 0:
    m = randint(1, 28)  # ходит человек
    n = n - m
    print('человек забрал:', m, ' конфет. осталось:', n, ' конфет')
    if n <= 28 and n > 0:
        print('ПОСЛЕ хода ЧЕЛОВЕКА осталось n:', n, 'выиграл бот')
        break
    else:
        k = 29 - m   # ходит бот
        n = n - k
        print('бот забрал:', k, ' конфет. осталось:', n, ' конфет')
        if n <= 28 and n > 0:
            print('ПОСЛЕ хода БОТА осталось n:', n, 'выиграл человек')
            break
